# Кортеж (tuple) в отличае от списка является неизменяемым объектом
# создание кортежа

# строки записываются внутри ''
# списки внутри []
# кортежи внутри()

# 1 вариант создания кортежа
# a = (1, 2, 3, 4, 5, 6)
# print(a, type(a))

# второй и более неявный вариант создания кортежа
# a = 1, 2, 3, 4, 5, 6
# print(a, type(a))

# важно элементы указывать через запятую, например. Если запятой не будет, это будет просто число записанное в переменную а
# a = 1,
# print(a, type(a))

# третий вариант создать кортеж, указать итерабельную последовательность
    # b = tuple(range(5))
# print(b, type(b))

# b = tuple((1, 2, 3))
# print(b, type(b))

#создать пустой кортеж
# a = ()
# print(a, type(a))
#или
# a = tuple()
# print(a, type(a))

#найти длину кортежа
# a = 1, 2, 3, 4, 5, 6
# print(len(a))
# находится ли элемент в этом кортеже
# print(2 in a) ответ True или False

#проверить на не вхождение элемента в котеж
# print(8 not in a) #ответ True или False

# сцепление кортежей
# a = 1, 2, 3, 4, 5, 6
# b = 55, 79, 56
# print(a+b)
# print(b+a)

#кортежи можно дублировать
# print(a * 2)

#функция минимума и максимума и суммы, но если в кортеже будут содержаться строки, то будет ошибка
# print(min(a), max(a), sum(a))

#все элементы имеют свой индекс
# a = 1, 2, 3, False, 5, 'Jun', 5, 3
# print(a[5])

# кортеж является неизменяемым объектом,если обратиться по индексу и попробовать изменить эелемент, получим ошибку
# a[3] = 56 !!!ОШИБКА не изменяемый объект
# print(a)

# У кортежа всего несколько методов, это index и count, оба эти метода не влияют на состояние самого кортежа
# print(a.index(3))
# print(a.count(3))

#!!!НО в кортеже может находиться список, а список это изменяемый обьект, поэтому внутри кортежа мы его можем менять, обратившись к списку по индексу
# a = 1, 2, 3, False, 5, [34, 87, 56, 45], 'Jun', 5, 3
# a[5].append(100)
# print(a)

#Для чего нужны кортежи
# 1. Если необходимо карантировать неизменяемость объектов
# 2. Кортежи занимают менще места в памяти, чем списки, быстрее обрабатываются программой
# a = [1, 2, 3, False, 5, [34, 87, 56, 45], 'Jun', 5, 3] #список а
# b = tuple([1, 2, 3, False, 5, [34, 87, 56, 45], 'Jun', 5, 3]) #из списка сделали кортеж
# print(a.__sizeof__()) #метод для проверки занимаемого места в памяти, данный список весит 112 байт
# print(b.__sizeof__()) # а кортеж весит 96 байт

# Кортежи могут быть созданы в качестве ключей словаря
# a = (1, 2, 3)
# b = {}
# b[a] = 'hello'
# print(b)

# Если нужно изменить кортеж, его нужно преобразовать в список
#  как это сделать
# a = (1, 2, 3)
# a = list(a) #сделать кортеж списком
# print(a, type(a))
# a = tuple(a) #снова вернуть в кортеж из списка
# print(a, type(a))

# Цикл for для кортежа
# a = (55, 10, 27, 3)
# for i in a: #= идем по элементам
#     print(i)

# for i in range (len(a)): #= идем по индексам
#     print(i) #выводим индексы
    # print(a[i]) #выводим элкмкнты

# a = 8
# b = 11
# res = tuple(a, b)
# print(res)

n = int(input())
if n % 2 == 0:
    c = tuple(i for i in range(n+1, (n ** 2) + 1, 2))
else:
    c = tuple(i for i in range(n,(n**2)+1,2))

print(c)
