# Округление
# функция trunc
# import math
# a = math.trunc(32.3) # в эту функцию можно передавать только 1 число. Эта функция оставляе целую часть от дробного числа = 32
# print(a)
import math

# int
# b = int(43.76) # также как и функция trunc оставляе целую часть от дробного числа = 43
# print(b)

# функция floor
# c = math.floor(23.6) #округление вниз = 23
# d = math.floor(-23.6) # c отрицательными числами нужно быть аккуратным, округление вниз = -24
# print(d)

# функция ceil
# e = math.ceil(34.1) #округление вверх = 35
# j = math.ceil(-3.4) # c отрицательными числами нужно быть аккуратным - округление вверх = -3
# print(j)

# import math
# n = 110
# mm = 10
# res = n / 10
# print(math.ceil(res))

n = -150 % 3
print(n)