# обычная функция:
# def f(x):
#     return x ** 2
#
# def perimetr(a, b, c):
#     return a + b + c

#лямбда (анонимная функция) = лямбда используется, когда функция выполняет одно действие или функция в одну строчку
# r = lambda x: x ** 2
#
# per = lambda a, b, c: a + b + c
#
# h = lambda: 'hello'
#
# print(h())

# Где используется лямбда
# создадим список и осортируем по возрастанию элементы
# у функции .sort() есть именованный аргумент = key=function он должен принимать функцию, которая говорит, по какому принципу мы хотим сортировать список
# в данном случае отсортируем по последней цифре и напишем для этого функцию

#функция
# def f(x):
#     return x % 10
#
#
# a = [34, 56, 345, 67, 23, 347, 5]
# a.sort(key=f)
# print(a) #в консоли [23, 34, 345, 5, 56, 67, 347]

# лямбда
# вместо функции f можно передать люмбду:

# a = [34, 56, 345, 67, 23, 347, 5]
# a.sort(key=lambda x: x%10)
# print(a) #в консоли [23, 34, 345, 5, 56, 67, 347]

# Напишите lambda функцию, которая принимает одно число и увеличивает его на 10.
# Для проверки решения присвойте вашу  lambda функцию переменной adding_10

# n = int(input())
# adding_10 = lambda a: a + 10
# print(adding_10(n))

# Напишите lambda функцию, которая принимает строку и отвечает на вопрос начинается ли переданная строка с буквы W
# Для проверки решения присвойте вашу  lambda функцию переменной starts_with

s = input()
starts_with = lambda s: s.startswith('W')
print(starts_with(s))

