# 1. Напишите программу, которая принимает на вход цифру,
# обозначающую день недели, и проверяет,
# является ли этот день выходным.

# n = int(input('Ведите число от 1 до 7, соответствующее дню недели, еси 1 это понедельник, а 7 воскресенье.'))
# if (n < 0 or n > 7):
#     print('данная цифра не соответствует дню недели')
# elif (n > 0 and n < 5):
#    print('Нет, это будний день')
# else:
#     print('Да, выходной ')

# 2.Напишите программу для. проверки истинности утверждения
# ¬(X ⋁ Y ⋁ Z) = ¬X ⋀ ¬Y ⋀ ¬Z для всех значений предикат.

# x = bool(input('Введите  X - true / false'))
# y = bool(input('Введите  Y true / false'))
# z = bool(input('Введите  Z true / false'))
# print(not (x and y and z) == (not x or not y or not z))

# 3. Напишите программу, которая принимает на вход координаты точки
# (X и Y), причём X ≠ 0 и Y ≠ 0 и выдаёт номер четверти плоскости,
# в которой находится эта точка (или на какой оси она находится).

# x = int(input('Введите координату оси X '))
# y = int(input('Введите координату оси Y '))
# if (x == 0 and y == 0):
#     print('Точка лежит в начале координат')
# elif (x == 0):
#     print('точка лежит на оси x')
# elif (y == 0):
#     print('точка лежит на оси y')
# elif (x > 0 and y > 0):
#     print('--> 1')
# elif (x < 0 and y > 0):
#     print('--> 2')
# elif (x < 0 and y < 0):
#     print('--> 3')
# else:
#     print('--> 4')

# 4. Напишите программу, которая по заданному номеру четверти, показывает диапазон
# возможных координат точек в этой четверти (x и y).

# num = int(input('Введите номер четверти от 1 до 4'))
# if (num == 1):
#     print('x > 0, y > 0')
# elif (num == 2):
#     print('x < 0, y > 0')
# elif (num == 3):
#     print('x < 0, y < 0')
# elif (num == 4):
#     print('x > 0, y < 0')
# else:
#     print('четверть указана не верно')

# 5.Напишите программу, которая принимает на вход координаты двух точек и находит
# расстояние между ними в 2D пространстве.

import math
x_1 = int(input('X1 -->'))
y_1 = int(input('Y1 -->'))
x_2 = int(input('X2 -->'))
y_2 = int(input('Y2 -->'))
res1 = (x_2 - x_1) ** 2
res2 = (y_2 - y_1) ** 2
result = math.sqrt(res1 + res2)
print(round(result, 2))
