# 1. Напишите программу, которая принимает на вход два числа и проверяет,
# является ли одно число квадратом другого.

# num_1 = int(input("введите число"))
# num_2 = int(input("введите второе число"))
#
# if (num_2 == (num_1 ** 2)) or (num_1 == (num_2 ** 2)):
#     print(True)
# else:
#     print(False)

# 2. Напишите программу, которая на вход принимает
# 5 чисел и находит максимальное из них.


# my_list.append(20) добавить элемент в список
# range(5) -> [0, 1, 2, 3, 4]
# range (5, 16) -> [5, 6, 7, ..... 13,  14, 15]
# range (1, 11, 2) -> [1, 3, 5, 7, 9] (2 это шаг)

# Заполнение списка из 5 чисел с вводом от пользователя
# my_list = []
# for i in range(5):
#     num = int(input('-->'))
#     my_list.append(num)
# print(my_list)
# нахождение максимального числа функция max
# print(max(my_list))

# пробежать по всему списку, чтобы найти максимальное число
# max_num = my_list[0]
# for item in my_list: # цикл проходит по всем индексам, если указать for item in my_list[1:]: то от первого индекса и до последнего, [2:4] с указанием границ (в скобках указан индекс)
#     if item > max_num:
#         max_num = item
# print(max_num)

# Пример срезов (срез создает новую копию списка)
# my_list = [3, 5, 1, 2, 8]
# print(my_list[1:3]) # От 1 индекса до 3 не включительно - вывод: 5. 1
# print(my_list[::2]) # от нулевого до последнего индекса, с шагом 2 - вывод 3,1,8

# нахождение индекса с максимальным значением элемента
# my_list = [3, 5, 1, 2, 8]
# max_num = my_list[0]
# max_i = 0
# for i in range(1, len(my_list)):
#     if my_list[i] > max_num:
#         max_num = my_list[i]
#         max_i = i
# print(max_i)

# 1. Напишите программу, которая будет на вход принимать
# число N и выводить числа от -N до N
# n = int(input('Ведите число N'))
# r = range(-n, n + 1)
# for i in r:
#     print(f'* {i} *')

# 2. Напишите программу, которая будет принимать
# на вход дробь и показывать первую цифру дробной части числа.

# n = (input('Ведите число '))
# метод split разделяет строку по точке и переводим в список, [1] это индекс, [0] индекс после точки
# print(n.split('.')[1][0])

# математический вариант решения
# number = float(input("Input number: "))
# number *= 10
# print(number)
# number = int(number)
# print(number)
# print(number % 10)

# 3. Напишите программу, которая принимает на вход число
# и проверяет, кратно ли оно (5 и 10) или (15, но не 30)

num = int(input("Введите число: "))
if ((num % 5 == 0) and (num % 10 == 0)) or ((num % 15 == 0) and (num % 30 != 0)):
    print("Да")
else:
    print("Нет")
