# Цикл while
# i = 1
# while i <= 10:
#     print(i, end=' ')
#     i += 1
#     break # останавливает цикл, считается плохой практикой, лучше завершать цикл условием
# else:
#     print('END!')

# i = 1
# while i <= 10:
#     print(i, end=' ')
#     i += 1
#     continue
#     print(123)
# else:
#     print('END!')

# 1. Напишите программу, которая принимает на вход число N и
# выдаёт последовательность из N членов.
# *Пример:*
# - Для N = 5: 1, -3, 9, -27, 81  (5 , * - 3;  -3 * 1 = -3, -3 * -3 = 9)

# n = int(input('Введите число N'))
# res = 1
# print(res, end=' ')
# r = range(n-1)
# for i in r:
#     res = res * -3
#     print(res, end=' ')

# 2. Для натурального n создать последовательности 3n + 1.
# *Пример:*
# - Для n = 6:
# 1: 4,
# 2: 7,
# 3: 10,
# 4: 13,
# 5: 16,
# 6: 19

# n = int(input('Введите число N'))
# i = 1
# while i <= n:
#     res = i * 3 + 1
#     print(f' {i}: {res} ')
#     i += 1

# 3. Напишите программу, в которой пользователь будет задавать две
# строки, а программа - определять количество вхождений одной строки в другой.
#
# *Пример:*
# 'Я люблю Питон!'
# 'лю'

# str1 = input('Введите первую строку')
# str2 = input('Введите вторую строку')
# count = str1.count(str2)
# print(f'{count} раз')
#
# другой вариант решения
# a = input('Введите первую строку')
# b = input('Введите вторую строку')
# count = 0
#
# for i in range (0, len(a) - len(b)):
#     if b == a[i:i + len(b)]:
#         count += 1
#
# print(f'{count}  раз')


