# Архитектура
# 1. Файль main = он запускает программу
# 2. Файль controller = в этом файде главная, осоновная функция. вся сборка
# 3. Файл model = математический модуль
# 4. Файл gui = запрашиваются и выводятся данные (input, print)
# 5. Файл data_base = данные записываются
#
#
# 1. Запрашиваем данные
# 2. Сохранить данные в базу данных
# 3. Данные вернулись в контроллер
# 3. Передаем в математические операции, этот файл нам возрещает результат
# 4. Возвращаем результат в контроллер
# 5.Выводим результат, gui выводит все на экран


