# 1. Задайте строку из набора чисел. Напишите программу, которая покажет большее и меньшее число.
# В качестве символа-разделителя используйте пробел.

# import function_practice4
# a = input('Введите строку чисел через пробел')
# function_practice4.getMaxMin(a)

# 2. Найдите корни квадратного уравнения Ax² + Bx + C = 0 двумя способами:
# 1) с помощью математических формул нахождения корней квадратного уравнения
# *2) с помощью дополнительных библиотек Python

# import function_practice4
# a = float(input('a = '))
# b = float(input('b = '))
# c = float(input('c = '))
# function_practice4.getMaxMin(a,b,c)

# 3. Задайте два числа. Напишите программу, которая найдёт НОК (наименьшее общее кратное) этих двух чисел.
# Ответ записать в файл.

import function_practice4

# a = float(input('a = '))
# b = float(input('b = '))
# function_practice4.getNok(a, b)

# другой вариант нахождение Нок, через библиотеку
# import math
# a = int(input('a = '))
# b = int(input('b = '))
# print(math.lcm(a, b))
# c = math.lcm(2)
# print(c)

print('/\_/\\''\n>^,^<''\n / \\''\n(|_|)_/')
